{
	"profileImage": "./public/resources/profile-picture.png",
	"firstName": "Gary K.",
	"lastName": "Yau",
	"occupation": "Developer. Designer. Quality Assurance.",
	"contact": {
		"phone": "+1 (778) 882 0524",
		"email": "gyau88@gmail.com",
		"location": "Vancouver, BC, CA",
		"socials":
		[
			{
				"name": "GitHub",
				"link": "https://github.com/garyyau",
				"linkText": "github.com/garyyau",
				"iconClasses": "zmdi zmdi-github-alt",
			},
			{
				"name": "LinkedIn",
				"link": "https://www.linkedin.com/in/garyyau",
				"linkText": "linkedin.com/in/garyyau",
				"iconClasses": "zmdi zmdi-linkedin",
			},
		]
	},
	"overview": "Frontend developer with a strong passion for developing inspirational web applications. Experience in different types of languages and frameworks with quick learning capabilities to adapt in different project requirements. Flexible in different working environments, having worked effectively both independently and as a team in an agile development process. Uses skillsets in user experience design, quality assurance, and software development onto each project with the objective of delivering high quality products.",
	"technicalProfile":
	[
		{
			"name": "Languages",
			"items":
			[
				"JavaScript ES6",
				"HTML5",
				"CSS3",
				"AJAX",
				"SASS",
				"Python",
				"PHP",
				// "SQL",
				// "JSON",
			],
		},
		{
			"name": "Frameworks",
			"items":
			[
				"React",
				"Redux",
				"AngularJS",
				"jQuery",
				"Django",
				"Laravel",
				"NodeJS",
			],
		},
		{
			"name": "Version Control",
			"items":
			[
				"Git (GitLab, GitHub)",
				"Subversion (TortoiseSVN)",
			],
		},
		{
			"name": "Project Tools",
			"items":
			[
				"GitLab",
				"GitHub",
				"Confluence",
				"JIRA",
			],
		},
		{
			"name": "Design Tools",
			"items":
			[
				"Sketch",
				"InVision",
				"Adobe Photoshop",
				"Illustrator",
				"myBalsamiq",
			],
		},
		{
			"name": "Methodologies",
			"items":
			[
				"Agile",
				"Scrum",
				"Unit Test",
				"Responsive Design",
			],
		},
	],
	"workExperience":
	[
		{
			"position": "Senior Frontend Developer",
			"company": "Thinkingbox",
			"location": "Vancouver, BC, Canada",
			"time": "April 2018 - Current",
			"description": "Develop new PaaS web application to provide internal services and large clients an easy workflow for web site development and deployment. Built front end web pages in AngularJS, SASS and HTML based on designer mockups, consuming a REST API for communication with backend servers. Integrate a custom support portal web application with external ConnectWise ticketing service for an user friendly client facing portal. Designed wireframes and mockups through requirement meetings and design review meetings with clients to provide an intuitive user interface design for client's safety web application. Managed a team of four developers through sprints in an Agile development environment.",
			"points":
			[
				"Research and develop prototypes to use frameworks in unique ways in order to test the limitations and learn more about the creative possibilities.",
				"Develop and solutioning creative intriguing websites for clients to modernize the technology and style that the client uses for advertising.",
				"Adapt and learn different frameworks such as FacebookAR and Prismic CMS to provide each project with the ideal stack based on the requirements of the project.",
			]
		},
		{
			"position": "Intermediate Frontend Developer/Scrum Master",
			"company": "Appnovation Technologies",
			"location": "Vancouver, BC, Canada",
			"time": "May 2016 - March 2018",
			"description": "Develop new PaaS web application to provide internal services and large clients an easy workflow for web site development and deployment. Built front end web pages in AngularJS, SASS and HTML based on designer mockups, consuming a REST API for communication with backend servers. Integrate a custom support portal web application with external ConnectWise ticketing service for an user friendly client facing portal. Designed wireframes and mockups through requirement meetings and design review meetings with clients to provide an intuitive user interface design for client's safety web application. Managed a team of four developers through sprints in an Agile development environment.",
			"points":
			[
				"Develop new PaaS web application to provide internal services and large clients an easy workflow for website development and deployment.",
				"Built front end web pages in AngularJS, SASS and HTML based on designer mockups, consuming a REST API for communication with backend servers.",
				"Integrate a custom support portal web application with external ConnectWise ticketing service for an user friendly client facing portal.",
				"Designed wireframes and mockups through requirement meetings and design review meetings with clients to provide an intuitive user interface design for client's safety web application.",
			]
		},
		{
			"position": "Junior Software Developer",
			"company": "DHX Media",
			"location": "Vancouver, BC, Canada",
			"time": "Mar 2014 - Apr 2016",
			"description": "Develop new web applications from requirements gathering, sprint planning, agile development, rollout to system maintenance to provide the studio with uniquely built systems to suit the needs of marketing, interactive and pipeline. Collaborate with a team of 4 - 7 developers to design and architect the structure of the projects to determine the optimal development approach and best technologies to use. Research on external studio management system, Shotgun, to assess the compatibility of Shotgun with daily workflow of the studio. Design custom system, Artemis, to be used on top of Shotgun in order to enhance the features provided and tailor it to the needs of the users. Develop and implement different APIs to upgrade legacy systems to use a unified database while planning for future systems to provide backwards compatibility with the past systems.",
			"points":
			[
				"Develop new web applications from requirements gathering, sprint planning, agile development, rollout to system maintenance to provide the studio with uniquely built systems to suit the needs of marketing, interactive and pipeline.",
				"Collaborate with a team of 4 - 7 developers to design and architect the structure of the projects to determine the optimal development approach and best technologies to use.",
				"Research on external studio management system, Shotgun, to assess the compatibility of Shotgun with daily workflow of the studio. Design custom system, Artemis, to be used on top of Shotgun in order to enhance the features provided and tailor it to the needs of the users.",
				"Develop and implement different APIs to upgrade legacy systems to use a unified database while planning for future systems to provide backwards compatibility with the past systems.",
			]
		},
		// {
		// 	"position": "Quality Assurance Tester",
		// 	"company": "Electronic Arts Canada",
		// 	"location": "Burnaby, BC, Canada",
		// 	"time": "Jun 2008 - Sep 2011",
		// 	"description": "Tested gaming software for Nintendo Wii, Xbox 360 and PlayStation 3 to ensure the quality of the company's product, allowing successful first-time passes on several first-party certifications. Specialized in Nintendo compliance and created compliance test cases for EA SPORTS Active and EA SPORTS Active More Workouts using DevTest to guide compliance testers during development process. Collaborated with project managers, team leads and other testers to analyze the coverage and risks of each test suite, ensuring that the requirements of the software was met while validating the stability of each build as the project progressed.",
		// 	"points":
		// 	[
		// 		"Tested gaming software for Nintendo Wii, Xbox 360 and PlayStation 3 to ensure the quality of the company's product, allowing successful first-time passes on several first-party certifications.",
		// 		"Specialized in Nintendo compliance and created compliance test cases for EA SPORTS Active and EA SPORTS Active More Workouts using DevTest to guide compliance testers during development process.",
		// 		"Collaborated with project managers, team leads and other testers to analyze the coverage and risks of each test suite, ensuring that the requirements of the software was met while validating the stability of each build as the project progressed.",
		// 	]
		// },
	],
	"education":
	[
		{
			"school": "Simon Fraser University",
			"program": "Major in Computing Science",
			"faculty": "Bachelor of Science",
			"time": "Dec 2013",
			"description": "Focused on Object-Oriented Programming and other software development concepts such as database design, networking and software engineering.",
		}
	],
	"projects":
	[
		{
			"name": "Sis Knows Best Facebook Instant Game",
			"location": "Thinkingbox",
			"roles": ["Senior Frontend Developer"],
			"stack": ["Facebook Platform", "GSAP", "Canvas"],
			"description": "Developed a shareable quiz Facebook Instant Game to promote the movie Nobody's Fool. Worked together with an Interactive Developer and creatives to integrate an engaging experience, while also reporting any found issues with the Facebook framework. Used GSAP to create a responsive and engaging experience for users to immerse themselves into the project."
		},
		{
			"name": "Vancouver Aquarium Website Refresh",
			"location": "Thinkingbox",
			"roles": ["Senior Frontend Developer"],
			"stack": ["Concrete5", "Javascript", "LESS"],
			"description": "Researched on variety of CMS to provide client with the best option for their requirements. Worked with a team of four developers to discover the usability and limitations of Concrete5, allowing a smooth development cycle. Developed a reusable block layout using Concrete5 that allows client to add to and restructure the website after hand-off while maintaining a consistent design throughout."
		},
		{
			"name": "Production Management System",
			"location": "DHX Media",
			"roles": ["Scrum Master", "Software Developer", "UX Designer"],
			"stack": ["Django, AngularJS, HTML, SCSS, MySQL"],
			"description": "Designed and developed task management system and show breakdown system alongside external system, Shotgun, to integrate Shotgun into studio pipeline while maintaining legacy system features. Developed an API to provide communication between Shotgun and legacy system, allowing corporate departments to continue using legacy system to enter user information while ensure information is passed to Shotgun. Led a team of five developers in an Agile scrum environment, allowing tasks to be completed within deadlines while reporting to Head of Software Department on schedule adjustments.",
		},
		// {
		// 	"name": "Muse Client Review",
		// 	"location": "DHX Media",
		// 	"roles": ["Software Developer"],
		// 	"stack": ["Django, AngularJS, HTML, SCSS, MySQL"],
		// 	"description": "Developed an external client review system connected to studio task management system through an API, allowing coordinators to send completed assets and shots for client review. Worked in a team of five developers and a designer in a sprint environment to plan and design the development architecture for the application ensure all requirements were considered in the design.",
		// },
		// {
		// 	"name": "Nerd Corps Production Sites",
		// 	"location": "DHX Media",
		// 	"roles": ["Software Developer"],
		// 	"stack": ["Laravel", "jQuery", "HTML", "SCSS", "MySQL"],
		// 	"description": "Design and  developed custom Content Management System for studio production sites, providing a way to perform efficient updates to website contents in the future. Developed multiple production websites such as kateandmimmim.ca with multi-browser support and responsive design to provide kids with a fun and interactive location to learn more about the show and receive updates.",
		// },
	],
	"coverLetter": {
		"content": ""
	}
}
